
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.ams_product[0].azurerm_api_management_product.product
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
* Replace
  * azurerm_role_assignment.vmuser_login[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.vmuser_login[0] must be replaced
-/+ resource "azurerm_role_assignment" "vmuser_login" {
      ~ id                               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox/providers/Microsoft.Compute/virtualMachines/edit-vm1-sbox/providers/Microsoft.Authorization/roleAssignments/d725cdf6-617b-8590-1b1c-885421b26e0c" -> (known after apply)
      ~ name                             = "d725cdf6-617b-8590-1b1c-885421b26e0c" -> (known after apply)
      ~ principal_id                     = "b1a50fb5-7ed3-4d03-9bd6-40b208c04012" -> "44bd6a54-10e5-441a-b5bb-3665ade67be1" # forces replacement
      ~ principal_type                   = "Group" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ams_product[0].azurerm_api_management_product.product will be updated in-place
  ~ resource "azurerm_api_management_product" "product" {
        id                    = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-sbox/products/pre-ams-integration"
      ~ subscriptions_limit   = 0 -> 20
        # (7 unchanged attributes hidden)
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/pre-sbox-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupsbox"
        name                              = "preingestsabackupsbox"
        tags                              = {
            "application"         = "pre-recorded-evidence"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (37 unchanged attributes hidden)

      ~ immutability_policy {
          ~ period_since_creation_in_days = 7 -> 1
            # (2 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":657,"Program":"tfcmt","SHA1":"","Vars":{}} -->